[
  {
    "id": 1,
    "name": "Akapulko",
    "scientificName": "Senna alata",
    "botany": "Akapulko is a coarse, erect, branched shrub, 1.5 to 3 meters high. Leaves are pinnate and 40 to 60 centimeters long, with orange rachis on stout branches. Each leaf has 16 to 28 leaflets, 5 to 15 centimeters in length, broad and rounded at the apex, with a small point at the tip. Leaflets gradually increase in size from the base towards the tip of the leaf. Inflorescences are terminal and at the axils of the leaves, in simple or panicled racemes, and 10 to 50 centimeters long. Flowers are yellow, about 4 centimeters inn diameter, at the axils of thin, yellow, oblong, concave bracts which are 2.5 to 3 centimeters long. Pod is rather straight, dark brown or nearly black, about 15 centimeters long and 15 millimeters wide. On both sides of the pods there is a wing that runs the length of the pod. Pod contains 50 to 60 flattened, triangular seeds.",
    "properties": "- Saponin acts as a laxative and expels intestinal parasites. - Its fungicide property derives from chrysophanic acid. - Plant considered alterative, astringent, abortifacient, aperient, expectorant, purgative, sudorific, hydragogue, diuretic, vermifuge.",
    "folkloric": "- The seeds used for intestinal parasitism. - Tincture from leaves reported to be purgative. - Decoction of leaves and flowers for cough and as expectorant in bronchitis and asthma. Also used as astringent. - Crushed leaves and juice extract used for ringworm, scabies, eczema, tinea infections, itches, insect bites, herpes.",
    "ointment": "(1) Wash fresh leaves thoroughly and cut in small pieces. (2) Add one glass of cooking oil or coconut oil to one glass of cut fresh leaves. (3) Fry until crispy. (4) Remove from the heat; strain. (5) Cut 2 white candles (Esperma No. 5) into small pieces. (6) In a cooking pot, pour the strained oil together with the candle pieces; stir until the candle has melted. (7) Pour the mixture into a clean container; cover when cool. (8) Apply the ointment to affected areas twice daily."
  },
  {
    "id": 2,
    "name": "Ampalaya",
    "scientificName": "Momordica charantia",
    "botany": "Ampalaya is a climbing vine, nearly or quite smooth, annual vine. Tendrils are simple, up to 20 centimeters long. Leaves are 2.5 to 10 centimeters in diameter, cut nearly to the base into 5 to 7 lobes, oblong ovate, variously toothed, and heart shaped at the base. Male flower is about 12 millimeters long, and is peduncled, with a rounded, green, and about 1 centimeter long bract approximately at the middle. Female flower is yellow flower, about 15 millimeters long, long stalked with pair of small leaflike bracts at middle or toward base of stalk. Fruit, in cultivated form, is green, fleshy, oblong, cylindric, 15 to 25 centimeters long, pointed at both ends, ribbed and wrinkled, bursting when mature to release seeds; in wild forms, ovoid, about 2 to 4 centimeters long. Seeds are oblong, compressed 10 to 13 millimeters long, and corrugated on the margins.",
    "properties": "- Considered astringent, antidiabetic, abortifacient, antirheumatic, contraceptive, galactagogue, parasiticide, anthelmintic, purgative, emetic, antipyretic, febrifuge, emmenagogue, cooling , tonic, vulnerary. - Fruit considered tonic and stomachic. - Studies have shown antidiabetic, adaptogenic, anti-inflammatory, membrane stabilizing, antioxidant, cholinomimetic, analgesic, antimicrobial, gastroprotective, hepatoprotective, anti-dengue, antifungal properties.",
    "folkloric": "- In the Philippines, juice expressed from the green fruit is given for chronic colitis: also used for bacillary dysentery. - Astringent powdered leaves or root decoction can be applied to hemorrhoids. - Leaf juice for cough and as a purgative and anthelminthic to expel intestinal parasites, and for healing wounds. - Seeds also used to expel worms. - The vine or the juice of leaves used as mild purgative for children. - In large doses, the fresh juice is a drastic purgative. - Decoction of roots and seeds used for urethral discharges. - Juice of leaves used for chronic coughs. - Leaves and shoots used as vulnerary. - Sap of leaves used as parasiticide. - Fruit macerated in oil used as vulnerary. - Fruit considered tonic and stomachic; used in rheumatism, gout, and diseases of the spleen and liver. - Pounded leaves used for scalds. - Infusion of leaves or leaf juice used for fevers. - Used for chronic stomach ulcers. - Root sometimes used as ingredient in aphrodisiac preparations. - Decoction of root used as abortifacient. - Fruit in large doses considered a drastic purgative and abortifacient. - In India, root used as astringent; applied externally to hemorrhoids. - In Lagos, decoction of leaves used as stomachic. - Leaves used as anthelmintic and antipyretic, and applied externally to leprosy. - In India and Malaya, pounded leaves are applied to skin diseases, burns and scalds. - Poultice of leaves used for headaches. - Infusion of flowers used for asthma. - Olive or almond oil infusion of the fruit, without the seeds, used for chapped hands, hemorrhoids, and burns. - Root, along with fruits and seeds, used as abortifacient, as well as remedy for urethral discharges. - In Batavia, vine used as anthelmintic, purgative, and emetic. - In Jamaica, leaf decoction or infusion is taken for colds, as laxative and blood cleanser. Warm tea infusions also used for toothaches and mouth infections. Also used as a bath/wash for skin eruptions and acne.",
    "ointment": "N/A"
  },
  {
    "id": 3,
    "name": "Bawang",
    "scientificName": "Allium sativum",
    "botany": "Bawang is a low herb, 30 to 60 centimeters high. True stem is much reduced. Bulbs are broadly ovoid, 2 to 4 centimeters in diameter, consisting of several, densely crowded, angular and truncated tubers. Leaves are linear and flat. Umbels are globose, many flowered. Sepals are oblong, greenish white, slightly tinged with purple. Stamens are not exerted from the perianth.",
    "properties": "• Considered antibacterial, anthelmintic, antimycotic, antiviral, antispasmodic, diaphoretic, expectorant, fibrinolytic, hypotensive, promoting leucocytosis, lipid lowering and platelet aggregation inhibition. - Studies have suggested antimicrobial, antihypertensive, antihyperlipidemic, anticancer, chemopreventive, antidiabetic, hepatoprotective, antithrombotic, analgesic, virucidal, nephroprotective, anti-H. pylori, repellent properties.",
    "folkloric": "- In the Philippines, bulbs used for hypertension. Also used as diuretic, and eaten fresh or burned for coughs in children. - Arthritis, rheumatism, toothaches: Crush several cloves and rub on affected areas. - Crush clove applied to both temples as poultice for headache. - Crush garlic or cut clove crosswise and rub directly to areas of insect bites. - Decoction of leaves and bulbs for fever and as hypotensive, carminative, expectorant, and antihelmintic. - Juice from freshly crushed garlic used for colds, cough, sore throat, hoarseness, asthma and bronchitis. - Decoction use for tonsillitis. - Steam inhalation of chopped garlic and a teaspoon of vinegar in boiling water used for nasal congestion. - Fresh garlic has been used as a complement to INH therapy for tuberculosis. In Mexico, fresh bulb is eaten as a preventive for tuberculosis. - In India, garlic juice diluted in water, applied externally to prevent hair from turning grey. - Diluted juice used for earaches and deafness. - In the Antilles, used as vermifuge. - Also used for menstrual cramps. - Used for digestive problems and gastrointestinal spasms. - Infusion of a peeled broiled clove used for gas pains. - Juice of bulb with common salt applied to bruises and sprains; also used for neuralgia and earache. - Rubbed over ringworm for soothing effect. - In WWI, fresh raw juice was used as antiseptic for control of wound suppuration.",
    "ointment": "N/A"
  },
  {
    "id": 4,
    "name": "Bayabas",
    "scientificName": "Psidium guajava",
    "botany": "Bayabas is a somewhat hairy plant reaching a height of 8 meters. Young branches are 4-angled. Leaves are opposite, oblong to elliptic, and 5 to 1 centimeters long, the apex being pointed, and the base usually rounded. Peduncles are 1- to 3-flowered. Flowers are white, 3 to 3.5 centimeters across, with in-curved petals, coming out solitary or two to three in the leaf axils. Numerous stamens form the attractive part of the flower. Inferior ovaries develop into round or obovoid green fruits 4 to 9 centimeters long, turning yellow on ripening and have edible, aromatic, seedy pulp.",
    "properties": "- Bark and leaves are astringent and vulnerary. - Studies have suggested antibacterial, antifungal, antioxidant, antihypertensive, antidiarrheal, hypoglycemic, antitumor, trypanocidal, antiproliferative, antispasmodic, hypocholesterolemic, hypoglycemic, hepatoprotective, anti-solar, gastroprotective, analgesic, antipyretic, hematopoietic, anti-plaque, nephroprotective, immunomodulatory properties.",
    "folkloric": "- In the Philippines, the astringent, unripe fruit, the leaves, bark cortex, and roots - though more often the leaves only - are used in decoction for washing ulcers and wounds. - Chewed or macerated leaves applied to circumcision wound for prevention or cure of infection. -Fresh leaves used for wounds and toothache. - Decoction or infusion of fresh leaves used for wound cleaning to prevent infection and to facilitate healing. - Warm decoction of leaves for aromatic baths. - For pasma, the salt residue from home ice-cream makers is mixed with water and bayabas leaves, boiled and used as a healing wash to the extremities. - Decoction of bark and leaves used for diarrhea. - For diarrhea, boil for 15 minutes 4 to 6 tablespoons of chopped leaves in 18 ounces of water. Strain and cool. Drink 1/4 of the decoction every 3 - 4 hours. - Bark used internally for chronic diarrhea of children and adults - half an ounce of the bark or root bark in six ounces of water is boiled down to 3 ounces, and given in teaspoon doses. Also used for prolapsus ani of children. - Decoction of rootbark also used as mouthwash for swollen gums. - Root-bark has been recommended for chronic diarrhea. - For toothache, chew 2-3 young leaves and put into the tooth cavity.",
    "ointment": "N/A"
  },
  {
    "id": 5,
    "name": "Lagundi",
    "scientificName": "Vitex negundo",
    "botany": "Lagundi is an erect, branched tree or shrub, 2 to 5 meters high. Leaves are usually 5-foliate, rarely with 3 leaflets only, and palmately arranged. Leaflets are lanceolate, entire, 4 to 10 centimeters long, slightly hairy beneath, and pointed at both ends, the middle leaflets being larger than the others, and distinctly stalked. Flowers are numerous, blue to lavender, 6 to 7 millimeters long, borne in terminal inflorescences (panicles) 10 to 20 centimeters long. Calyx is hairy, and 5-toothed. Corolla is densely hairy in the throat, and the middle lobe of the lower lip is longest. Fruit is a succulent drupe, globose, black when ripe, about 4 millimeters in diameter.",
    "properties": "- Plant is considered anti-inflammatory, astringent, antibacterial, antifungal, analgesic, alterant, depurative, rejuvenating, stomachic. - Roots considered tonic, febrifuge, anti-rheumatic, diuretic and expectorant. - Leaves and seeds considered vulnerary. - Leaves are considered aromatic, bitter, anti-inflammatory, bronchial smooth muscle relaxant, lactagogue, emmenagogue, insecticide, and vermifuge. - Flowers are astringent, carminative, hepatoprotective, digestive, vermifuge and febrifuge. - Fruit is considered nervine, cephalic, aphrodisiac, emmenagogue and vermifuge. - Studies have suggested antivenom. anti-inflammatory, antibacterial, analgesic, antifungal, insecticidal, anticonvulsant, larvicidal, anthelmintic, antioxidant, anxiolytic, hepatoprotective, gastroprotective, antiamnesic, antidiabetic, antieosinophilic, antiproliferative, mosquitocidal, anti-scabies, anti-typhoid properties.",
    "folkloric": "- Decoction of leaves used externally for cleaning ulcers and internally for flatulence. Also used as a lactagogue and emmenagogue. - Decoction of bark, tops and leaves used as antigastralgic. - Leaves used in aromatic baths; also as insectifuge. - Vapor bath prepared with the plant used for treatment of febrile, catarrhal, and rheumatic affections. - Decoction of leaves used as warm bath by women suffering with after-pains in the puerperal period. Also used as baths for new born children. - Seeds are boiled in water and eaten or the water drunk to prevent the spread of toxin from bites of poisonous animals. - Infusion of seeds used for disinfecting wounds and ulcers. - Infusion of seeds in wine used for dropsy. - Pounded leaves applies on the forehead and temples for headaches. - Leaf decoction for fever, headache, toothache, cough, asthma. - Root used as tonic, febrifuge and expectorant. - Fruit used as nervine, cephalic, and emmenagogue. - Tincture of root bark used for irritable bladder and for rheumatism. - Powdered root used for piles as demulcent; also for dysentery. - Root used for dyspepsia, colic, rheumatism, worms, boils, and leprosy. - Flowers are used for diarrhea, cholera, fever, and diseases of the liver; and also as cardiac tonic. - Powdered flowers and stalks are used for bleeding from the stomach and bowels. - Fruit used for headaches, catarrh, and watery eyes. Dried fruits are used as vermifuge. - Seeds are prepared as cooling medicine for skin diseases, leprosy, and inflammation of the mouth. - Oil prepared with the juice used for sinuses and scrofulous sores. Oil also used as a rubbing application to glandular or tubercular swelling of the neck. Oil also used for treatment of sloughing wounds and ulcers. - Leaves used for reducing inflammatory and rheumatic swellings of the joints and testicular swelling associated with gonorrheal epididymitis and orchitis. Poultice of leaves also applied to sprained limbs, contusions, leech bites, etc. For these, fresh leaves in an earthen pot are heated over fire, and applied and applied as tolerated over the bruised parts. Leaves heated over fire are also applied with oil externally on wounds. - Pillow stuffed with leaves is placed under the head for relief of catarrh and headache. Dried leaves when smoked also used to relieve catarrh and headaches. - Decoction of leaves and long pepper used for catarrhal fever associated with head congestion and dullness of hearing. - Juice of leaves used to remove fetid discharges and worms from ulcers. - Plaster of leaves applied to enlarged spleens.",
    "ointment": "N/A"
  },
  {
    "id": 6,
    "name": "Sambong",
    "scientificName": "Blumea balsamifera",
    "botany": "Sambong is a half woody, strongly aromatic shrub, densely and softly hairy, 1 to 4 meters high. Stems grow up to 2.5 centimeters in diameter. Leaves are simple, alternate, elliptic- to oblong-lanceolate, 7 to 20 centimeters long, toothed at the margins, pointed or blunt at the tip, narrowing to a short petiole which are often auricled or appendaged. Flowering heads are stalked, yellow and numerous, 6 to 7 millimeters long, and borne on branches of a terminal, spreading or pyramidal leafy panicle. Discoid flowers are of two types: peripheral ones tiny, more numerous, with tubular corolla; central flowers few, large with campanulate corolla. Involucral bracts are green, narrow and hairy. Anther cells tailed at base. Fruits are achenes, dry, 1-seeded, 10-ribbed, hairy at top.",
    "properties": "- Considered anthelmintic, antidiarrheal, antigastralgic, antispasmodic, astringent, carminative, emmenagogue, expectorant, stomachic, and vulnerary. - Studies have suggested anticancer, urolithiatic, plasmin-inhibiitory, antioxidant, antimicrobial, antispasmodic, antifungal, wound healing, antiplasmodial, hepatoprotective, xanthine-oxidase inhibitory, tyrosinase inhibitory, antiaging, fumigant, aldose-reductase inhibitory, gastroprotective, ace-inhibitory, antifertility, antidiabetic, antiobesity, antiviral properties.",
    "folkloric": "- Leaves as poultice for abscesses. - Decoction of roots and leaves for fevers, kidney stones, and cystitis. - Decoction of leaves used to induced diuresis for purpose of treating kidney stones. - Sitz-bath of boiled leaves, 500 gms to a gallon of water, for rheumatic pains of waist and back. - Used in upper and lower respiratory tract affections like sinusitis, asthmatic bronchitis, influenza. - Applied while hot over the sinuses. Used for wounds and cuts. Fresh juice of leaves to wounds and cuts. - Poultice of leaves applied to the forehead for relief of headaches.",
    "ointment": "N/A"
  },
  {
    "id": 7,
    "name": "Tsaang-gubat",
    "scientificName": "Ehretia microphilla",
    "botany": "Tsaang gubat is an erect, very branched shrub growing up to 1 to 4 meters high. Leaves are in clusters on short branches, obovate to oblong-obovate, 3 to 6 centimeters long, entire or somewhat toothed or lobed near the apex and pointed at the base, short stalked and rough on the upper surface. Flowers are white, small, axillary, solitary, 2 or 4 on a common stalk, borne in inflorescences shorter than the leaves. Calyx lobes are green, somewhat hairy, and linear, about 5 to 6 millimeters long. Corolla is white, 5 millimeters long, and divided into oblong lobes. Fruit is a drupe, rounded, yellow when ripe, 4 to 5 millimeters in diameter, fleshy, with a 4-seeded stone, fleshy on the outer part, and stony inside.",
    "properties": "- Considered analgesic, anti-diabetic, anti-inflammatory, anti-microbial, antispasmodic and anti-mutagenic. - Studies have shown anti-allergic, anti-inflammatory, analgesic, antidiarrheal, antibacterial, antimutagenic, antitumor, antiproliferative, wound healing, antiangiogenic, antioxidant properties.",
    "folkloric": "- Leaf decoction or infusion for abdominal colic, cough, diarrhea and dysentery. - Root decoction used as an antidote for vegetable poisoning. - For diarrhea: Boil 8 tbsp of chopped leaves in 2 glasses of water for 15 minutes; strain and cool. Use 1/4 of the decoction every 2 or 3 hours. Decoction has also been used as a dental mouthwash. - Decoction of leaves used as disinfectant wash after childbirth.",
    "ointment": "N/A"
  },
  {
    "id": 8,
    "name": "Ulasimang-bato",
    "scientificName": "Peperomia pellucida",
    "botany": "Pansit-pansitan is an erect, branched, annual herb, shallow rooted, reaching up to 40 centimeters high, with very succulent stems. Stems are round, often about 5 millimeters thick. Leaves are alternate, heart-shaped and turgid, as transparent and smooth as candle wax. Spikes are green, erect, very slender, 1 to 6 centimeters long. Tiny dot-like flowers scattered along solitary and leaf-opposed stalk (spike); naked; maturing gradually from the base to the tip; turning brown when ripe.",
    "properties": "- Considered anti-inflammatory, antibacterial, refrigerant, analgesic, antifungal, anticancer. - Studies have shown analgesic, anti-inflammatory, CNS depressant, antioxidant, antihyperuricemic, hypoglycemic, antihypertensive, antibacterial, antiarthritic, anticancer, antiedematogenic, anti-amoebic, gastroprotective, and hemostatic properties.",
    "folkloric": "- Infusion and decoction of leaves and stems are used for gout and arthritis. - Decoction of leaves used for urinary tract infections. - Externally, as a facial rinse for complexion problems. - In Ayurveda, used to pacify vitiated cough, pitta, constipation, kidney diseases, urinary retention, dysuria, urinary tract infection, emaciation, edema and general weakness. (15) - Pounded whole plant used as warm poultice for boils, pustules and pimples.",
    "ointment": "N/A"
  },
  {
    "id": 9,
    "name": "Yerba-buena",
    "scientificName": "Mentha arvensis",
    "botany": "Hierba buena is a prostrate, smooth , much-branched, usually purplish, strongly aromatic herb, with stems growing up to 40 centimeters long, with ultimate ascending terminal branches. Leaves are elliptic to oblong-ovate, 1.5 to 4 centimeters long, short-stalked with toothed margins, and rounded or blunt tipped. Flowers are hairy and purplish to bluish, borne in axillary head-like whorls. Calyx teeth are triangular or lanceolate and hairy; the corolla is also hairy.",
    "properties": "- Carminative, stimulant, stomachic, aromatic, antiseptic, antispasmodic, sudorific, emmenagogue. - Oil is rubefacient and stimulant. - Tops and leaves are carminative.",
    "folkloric": "- One of the oldest household remedies known. - In the Philippines, tops and leaves are considered carminative; when bruised used as antidote to stings of poisonous insects. - Mint is used in neuralgic affections, renal and vesical calculus. - Used for stomach weakness and diarrhea. - Decoction and infusion of leaves and stems used for fever, stomach aches, dysmenorrhea, and diuresis. - Pounded leaves for insect bites, fevers, toothaches, headaches. - Crushed fresh plants or leaves are sniffed for dizziness. - Powdered dried plant as dentrifice. - Crushed leaves are applied on the forehead and temples for headaches. - For toothaches: (1) Wet a small piece of cotton with juice expressed from crushed leaves; apply this impregnated cotton bud to the tooth. (2) Boil 6 tbsp. of leaves in two glasses of water for 15 minutes; strain and cool. Divide the decoction into 2 parts and take every 3 to 4 hours. - For flatulence: Boil 4 tbsp of chopped leaves in 1 cup water for five minutes; strain. Drink the decoction while lukewarm. Facilitates expulsion of flatus. - Alcohol or ether extract used as local anesthetic for affections of the nose, pharynx, and larynx. - Used for obstinate vomiting of pregnancy. - An alcoholic solution of menthol has been used as inhalation for asthma. Menthol is also used as local anesthesia for headache and facial neuralgia. - Decoction or vapor from menthol used with lemon grass as febrifuge. Also used in hiccups. - Plant used as emmenagogue; also used in jaundice. - Dried plant used as dentrifice. - Leaves and stems used as carminative, antispasmodic, and sudorific. - Infusion of leaves used for indigestion, rheumatic pans, arthritis and inflamed joints. - For coughs, boil 6 tbsp of chopped leaves in 2 glasses of water for 15 mins; cool and strain. Divide the decoction into three parts; take 1 part 3 times a day. - Diluted essential oil used as wash for skin irritations, burns, pruritus, scabies, ringworm and as mosquito repellent. - For arthritis, warm fresh leaves over low flame; then pound. Apply pounded leaves while warm on the painful joints or muscles. - As mouthwash, soak 2 tbsp chopped leaves in 1 glass of hot water for 30 minutes; strain. Use the infusion as mouthwash.",
    "ointment": "N/A"
  }
]
