[
  {
    "id": 1,
    "name": "Ampalaya",
    "scientificName": "Momordica charantia",
    "botany": "Ampalaya is a climbing vine, nearly or quite smooth, annual vine. Tendrils are simple, up to 20 centimeters long. Leaves are 2.5 to 10 centimeters in diameter, cut nearly to the base into 5 to 7 lobes, oblong ovate, variously toothed, and heart shaped at the base. Male flower is about 12 millimeters long, and is peduncled, with a rounded, green, and about 1 centimeter long bract approximately at the middle. Female flower is yellow flower, about 15 millimeters long, long stalked with pair of small leaflike bracts at middle or toward base of stalk. Fruit, in cultivated form, is green, fleshy, oblong, cylindric, 15 to 25 centimeters long, pointed at both ends, ribbed and wrinkled, bursting when mature to release seeds; in wild forms, ovoid, about 2 to 4 centimeters long. Seeds are oblong, compressed 10 to 13 millimeters long, and corrugated on the margins.",
    "properties": "Considered astringent, antidiabetic, abortifacient, antirheumatic, contraceptive, galactagogue, parasiticide, anthelmintic, purgative, emetic, antipyretic, febrifuge, emmenagogue, cooling , tonic, vulnerary. - Fruit considered tonic and stomachic. - Studies have shown antidiabetic, adaptogenic, anti inflammatory, membrane stabilizing, antioxidant, cholinomimetic, analgesic, antimicrobial, gastroprotective, hepatoprotective, anti dengue, antifungal properties.",
    "folkloric": "In the Philippines, juice expressed from the green fruit is given for chronic colitis: also used for bacillary dysentery. - Astringent powdered leaves or root decoction can be applied to hemorrhoids. - Leaf juice for cough and as a purgative and anthelminthic to expel intestinal parasites, and for healing wounds. - Seeds also used to expel worms. - The vine or the juice of leaves used as mild purgative for children. - In large doses, the fresh juice is a drastic purgative. - Decoction of roots and seeds used for urethral discharges. - Juice of leaves used for chronic coughs. - Leaves and shoots used as vulnerary. - Sap of leaves used as parasiticide. - Fruit macerated in oil used as vulnerary. - Fruit considered tonic and stomachic; used in rheumatism, gout, and diseases of the spleen and liver. - Pounded leaves used for scalds. - Infusion of leaves or leaf juice used for fevers. - Used for chronic stomach ulcers. - Root sometimes used as ingredient in aphrodisiac preparations. - Decoction of root used as abortifacient. - Fruit in large doses considered a drastic purgative and abortifacient. - In India, root used as astringent; applied externally to hemorrhoids. - In Lagos, decoction of leaves used as stomachic. - Leaves used as anthelmintic and antipyretic, and applied externally to leprosy. - In India and Malaya, pounded leaves are applied to skin diseases, burns and scalds. - Poultice of leaves used for headaches. - Infusion of flowers used for asthma. - Olive or almond oil infusion of the fruit, without the seeds, used for chapped hands, hemorrhoids, and burns. - Root, along with fruits and seeds, used as abortifacient, as well as remedy for urethral discharges. - In Batavia, vine used as anthelmintic, purgative, and emetic. - In Jamaica, leaf decoction or infusion is taken for colds, as laxative and blood cleanser. Warm tea infusions also used for toothaches and mouth infections. Also used as a bath/wash for skin eruptions and acne.",
    "ointment": "N/A"
  },
  {
    "id": 2,
    "name": "Bawang",
    "scientificName": "Allium sativum",
    "botany": "Bawang is a low herb, 30 to 60 centimeters high. True stem is much reduced. Bulbs are broadly ovoid, 2 to 4 centimeters in diameter, consisting of several, densely crowded, angular and truncated tubers. Leaves are linear and flat. Umbels are globose, many flowered. Sepals are oblong, greenish white, slightly tinged with purple. Stamens are not exerted from the perianth.",
    "properties": "Considered antibacterial, anthelmintic, antimycotic, antiviral, antispasmodic, diaphoretic, expectorant, fibrinolytic, hypotensive, promoting leucocytosis, lipid lowering and platelet aggregation inhibition. - Studies have suggested antimicrobial, antihypertensive, antihyperlipidemic, anticancer, chemopreventive, antidiabetic, hepatoprotective, antithrombotic, analgesic, virucidal, nephroprotective, anti H. pylori, repellent properties.",
    "folkloric": "In the Philippines, bulbs used for hypertension. Also used as diuretic, and eaten fresh or burned for coughs in children. - Arthritis, rheumatism, toothaches: Crush several cloves and rub on affected areas. - Crush clove applied to both temples as poultice for headache. - Crush garlic or cut clove crosswise and rub directly to areas of insect bites. - Decoction of leaves and bulbs for fever and as hypotensive, carminative, expectorant, and antihelmintic. - Juice from freshly crushed garlic used for colds, cough, sore throat, hoarseness, asthma and bronchitis. - Decoction use for tonsillitis. - Steam inhalation of chopped garlic and a teaspoon of vinegar in boiling water used for nasal congestion. - Fresh garlic has been used as a complement to INH therapy for tuberculosis. In Mexico, fresh bulb is eaten as a preventive for tuberculosis. - In India, garlic juice diluted in water, applied externally to prevent hair from turning grey. - Diluted juice used for earaches and deafness. - In the Antilles, used as vermifuge. - Also used for menstrual cramps. - Used for digestive problems and gastrointestinal spasms. - Infusion of a peeled broiled clove used for gas pains. - Juice of bulb with common salt applied to bruises and sprains; also used for neuralgia and earache. - Rubbed over ringworm for soothing effect. - In WWI, fresh raw juice was used as antiseptic for control of wound suppuration.",
    "ointment": "N/A"
  },
  {
    "id": 3,
    "name": "Sambong",
    "scientificName": "Blumea balsamifera",
    "botany": "Sambong is a half woody, strongly aromatic shrub, densely and softly hairy, 1 to 4 meters high. Stems grow up to 2.5 centimeters in diameter. Leaves are simple, alternate, elliptic to oblong lanceolate, 7 to 20 centimeters long, toothed at the margins, pointed or blunt at the tip, narrowing to a short petiole which are often auricled or appendaged. Flowering heads are stalked, yellow and numerous, 6 to 7 millimeters long, and borne on branches of a terminal, spreading or pyramidal leafy panicle. Discoid flowers are of two types: peripheral ones tiny, more numerous, with tubular corolla; central flowers few, large with campanulate corolla. Involucral bracts are green, narrow and hairy. Anther cells tailed at base. Fruits are achenes, dry, 1-seeded, 10-ribbed, hairy at top.",
    "properties": "Considered anthelmintic, antidiarrheal, antigastralgic, antispasmodic, astringent, carminative, emmenagogue, expectorant, stomachic, and vulnerary. - Studies have suggested anticancer, urolithiatic, plasmin inhibiitory, antioxidant, antimicrobial, antispasmodic, antifungal, wound healing, antiplasmodial, hepatoprotective, xanthine-oxidase inhibitory, tyrosinase inhibitory, antiaging, fumigant, aldose-reductase inhibitory, gastroprotective, ace-inhibitory, antifertility, antidiabetic, antiobesity, antiviral properties.",
    "folkloric": "Leaves as poultice for abscesses. - Decoction of roots and leaves for fevers, kidney stones, and cystitis. - Decoction of leaves used to induced diuresis for purpose of treating kidney stones. - Sitz bath of boiled leaves, 500 gms to a gallon of water, for rheumatic pains of waist and back. - Used in upper and lower respiratory tract affections like sinusitis, asthmatic bronchitis, influenza. - Applied while hot over the sinuses. Used for wounds and cuts. Fresh juice of leaves to wounds and cuts. - Poultice of leaves applied to the forehead for relief of headaches.",
    "ointment": "N/A"
  },
  {
    "id": 4,
    "name": "Tsaang-gubat",
    "scientificName": "Ehretia microphilla",
    "botany": "Tsaang gubat is an erect, very branched shrub growing up to 1 to 4 meters high. Leaves are in clusters on short branches, obovate to oblong obovate, 3 to 6 centimeters long, entire or somewhat toothed or lobed near the apex and pointed at the base, short stalked and rough on the upper surface. Flowers are white, small, axillary, solitary, 2 or 4 on a common stalk, borne in inflorescences shorter than the leaves. Calyx lobes are green, somewhat hairy, and linear, about 5 to 6 millimeters long. Corolla is white, 5 millimeters long, and divided into oblong lobes. Fruit is a drupe, rounded, yellow when ripe, 4 to 5 millimeters in diameter, fleshy, with a 4 seeded stone, fleshy on the outer part, and stony inside.",
    "properties": "Considered analgesic, anti diabetic, anti inflammatory, anti microbial, antispasmodic and anti mutagenic. - Studies have shown anti allergic, anti inflammatory, analgesic, antidiarrheal, antibacterial, antimutagenic, antitumor, antiproliferative, wound healing, antiangiogenic, antioxidant properties.",
    "folkloric": "Leaf decoction or infusion for abdominal colic, cough, diarrhea and dysentery. - Root decoction used as an antidote for vegetable poisoning. - For diarrhea: Boil 8 tbsp of chopped leaves in 2 glasses of water for 15 minutes; strain and cool. Use 1/4 of the decoction every 2 or 3 hours. Decoction has also been used as a dental mouthwash. - Decoction of leaves used as disinfectant wash after childbirth.",
    "ointment": "N/A"
  },
  {
    "id": 5,
    "name": "Ulasimang-bato",
    "scientificName": "Peperomia pellucida",
    "botany": "Pansit pansitan is an erect, branched, annual herb, shallow rooted, reaching up to 40 centimeters high, with very succulent stems. Stems are round, often about 5 millimeters thick. Leaves are alternate, heartshaped and turgid, as transparent and smooth as candle wax. Spikes are green, erect, very slender, 1 to 6 centimeters long. Tiny dot like flowers scattered along solitary and leaf opposed stalk (spike); naked; maturing gradually from the base to the tip; turning brown when ripe.",
    "properties": "Considered anti inflammatory, antibacterial, refrigerant, analgesic, antifungal, anticancer. - Studies have shown analgesic, anti inflammatory, CNS depressant, antioxidant, antihyperuricemic, hypoglycemic, antihypertensive, antibacterial, antiarthritic, anticancer, antiedematogenic, anti amoebic, gastroprotective, and hemostatic properties.",
    "folkloric": "Infusion and decoction of leaves and stems are used for gout and arthritis. - Decoction of leaves used for urinary tract infections. - Externally, as a facial rinse for complexion problems. - In Ayurveda, used to pacify vitiated cough, pitta, constipation, kidney diseases, urinary retention, dysuria, urinary tract infection, emaciation, edema and general weakness. (15) - Pounded whole plant used as warm poultice for boils, pustules and pimples.",
    "ointment": "N/A"
  },
  {
    "id": 6,
    "name": "Yerba-buena",
    "scientificName": "Mentha arvensis",
    "botany": "Hierba buena is a prostrate, smooth , much branched, usually purplish, strongly aromatic herb, with stems growing up to 40 centimeters long, with ultimate ascending terminal branches. Leaves are elliptic to oblong ovate, 1.5 to 4 centimeters long, short stalked with toothed margins, and rounded or blunt tipped. Flowers are hairy and purplish to bluish, borne in axillary head like whorls. Calyx teeth are triangular or lanceolate and hairy; the corolla is also hairy.",
    "properties": "- Carminative, stimulant, stomachic, aromatic, antiseptic, antispasmodic, sudorific, emmenagogue. - Oil is rubefacient and stimulant. - Tops and leaves are carminative.",
    "folkloric": "- One of the oldest household remedies known. - In the Philippines, tops and leaves are considered carminative; when bruised used as antidote to stings of poisonous insects. - Mint is used in neuralgic affections, renal and vesical calculus. - Used for stomach weakness and diarrhea. - Decoction and infusion of leaves and stems used for fever, stomach aches, dysmenorrhea, and diuresis. - Pounded leaves for insect bites, fevers, toothaches, headaches. - Crushed fresh plants or leaves are sniffed for dizziness. - Powdered dried plant as dentrifice. - Crushed leaves are applied on the forehead and temples for headaches. - For toothaches: (1) Wet a small piece of cotton with juice expressed from crushed leaves; apply this impregnated cotton bud to the tooth. (2) Boil 6 tbsp. of leaves in two glasses of water for 15 minutes; strain and cool. Divide the decoction into 2 parts and take every 3 to 4 hours. - For flatulence: Boil 4 tbsp of chopped leaves in 1 cup water for five minutes; strain. Drink the decoction while lukewarm. Facilitates expulsion of flatus. - Alcohol or ether extract used as local anesthetic for affections of the nose, pharynx, and larynx. - Used for obstinate vomiting of pregnancy. - An alcoholic solution of menthol has been used as inhalation for asthma. Menthol is also used as local anesthesia for headache and facial neuralgia. - Decoction or vapor from menthol used with lemon grass as febrifuge. Also used in hiccups. - Plant used as emmenagogue; also used in jaundice. - Dried plant used as dentrifice. - Leaves and stems used as carminative, antispasmodic, and sudorific. - Infusion of leaves used for indigestion, rheumatic pans, arthritis and inflamed joints. - For coughs, boil 6 tbsp of chopped leaves in 2 glasses of water for 15 mins; cool and strain. Divide the decoction into three parts; take 1 part 3 times a day. - Diluted essential oil used as wash for skin irritations, burns, pruritus, scabies, ringworm and as mosquito repellent. - For arthritis, warm fresh leaves over low flame; then pound. Apply pounded leaves while warm on the painful joints or muscles. - As mouthwash, soak 2 tbsp chopped leaves in 1 glass of hot water for 30 minutes; strain. Use the infusion as mouthwash.",
    "ointment": "N/A"
  }
]
